## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.static must be replaced
-/+ resource "google_storage_bucket" "static" {
      - default_event_based_hold    = false -> null
      ~ effective_labels            = {} -> (known after apply)
      - enable_object_retention     = false -> null
      ~ id                          = "hendry-bq-terraform-stg" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "hendry-bq-terraform-stg" -> "hendry-bq-terraformpr-stg" # forces replacement
      ~ project                     = "stgtest-424513" -> (known after apply)
      ~ project_number              = 270438815771 -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ rpo                         = "DEFAULT" -> (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/hendry-bq-terraform-stg" -> (known after apply)
      ~ terraform_labels            = {} -> (known after apply)
      ~ url                         = "gs://hendry-bq-terraform-stg" -> (known after apply)
        # (4 unchanged attributes hidden)

      - soft_delete_policy {
          - effective_time             = "2024-05-27T08:49:06.366Z" -> null
          - retention_duration_seconds = 604800 -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>